{"keras_version": "2.1.0", "config": {"output_layers": [["up_sampling2d_3", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 256, 256, 1], "dtype": "float32", "sparse": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "filters": 64, "bias_constraint": null, "kernel_size": [3, 3], "strides": [2, 2], "activation": "relu", "data_format": "channels_last", "trainable": true, "name": "conv2d_204", "use_bias": true}, "name": "conv2d_204", "inbound_nodes": [[["input_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "filters": 128, "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "trainable": true, "name": "conv2d_205", "use_bias": true}, "name": "conv2d_205", "inbound_nodes": [[["conv2d_204", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "filters": 128, "bias_constraint": null, "kernel_size": [3, 3], "strides": [2, 2], "activation": "relu", "data_format": "channels_last", "trainable": true, "name": "conv2d_206", "use_bias": true}, "name": "conv2d_206", "inbound_nodes": [[["conv2d_205", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "filters": 256, "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "trainable": true, "name": "conv2d_207", "use_bias": true}, "name": "conv2d_207", "inbound_nodes": [[["conv2d_206", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "filters": 256, "bias_constraint": null, "kernel_size": [3, 3], "strides": [2, 2], "activation": "relu", "data_format": "channels_last", "trainable": true, "name": "conv2d_208", "use_bias": true}, "name": "conv2d_208", "inbound_nodes": [[["conv2d_207", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "filters": 512, "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "trainable": true, "name": "conv2d_209", "use_bias": true}, "name": "conv2d_209", "inbound_nodes": [[["conv2d_208", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"batch_input_shape": [null, 1000], "dtype": "float32", "sparse": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "filters": 512, "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "trainable": true, "name": "conv2d_210", "use_bias": true}, "name": "conv2d_210", "inbound_nodes": [[["conv2d_209", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"n": 1024, "trainable": true, "name": "repeat_vector_1"}, "name": "repeat_vector_1", "inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "RepeatVector"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "filters": 256, "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "trainable": true, "name": "conv2d_211", "use_bias": true}, "name": "conv2d_211", "inbound_nodes": [[["conv2d_210", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"target_shape": [32, 32, 1000], "trainable": true, "name": "reshape_1"}, "name": "reshape_1", "inbound_nodes": [[["repeat_vector_1", 0, 0, {}]]], "class_name": "Reshape"}, {"config": {"trainable": true, "name": "concatenate_1", "axis": 3}, "name": "concatenate_1", "inbound_nodes": [[["conv2d_211", 0, 0, {}], ["reshape_1", 0, 0, {}]]], "class_name": "Concatenate"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "filters": 256, "bias_constraint": null, "kernel_size": [1, 1], "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "trainable": true, "name": "conv2d_212", "use_bias": true}, "name": "conv2d_212", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "filters": 128, "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "trainable": true, "name": "conv2d_213", "use_bias": true}, "name": "conv2d_213", "inbound_nodes": [[["conv2d_212", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "size": [2, 2], "trainable": true, "name": "up_sampling2d_1"}, "name": "up_sampling2d_1", "inbound_nodes": [[["conv2d_213", 0, 0, {}]]], "class_name": "UpSampling2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "filters": 64, "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "trainable": true, "name": "conv2d_214", "use_bias": true}, "name": "conv2d_214", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "size": [2, 2], "trainable": true, "name": "up_sampling2d_2"}, "name": "up_sampling2d_2", "inbound_nodes": [[["conv2d_214", 0, 0, {}]]], "class_name": "UpSampling2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "filters": 32, "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "trainable": true, "name": "conv2d_215", "use_bias": true}, "name": "conv2d_215", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "filters": 16, "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "trainable": true, "name": "conv2d_216", "use_bias": true}, "name": "conv2d_216", "inbound_nodes": [[["conv2d_215", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "filters": 2, "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "activation": "tanh", "data_format": "channels_last", "trainable": true, "name": "conv2d_217", "use_bias": true}, "name": "conv2d_217", "inbound_nodes": [[["conv2d_216", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "size": [2, 2], "trainable": true, "name": "up_sampling2d_3"}, "name": "up_sampling2d_3", "inbound_nodes": [[["conv2d_217", 0, 0, {}]]], "class_name": "UpSampling2D"}], "input_layers": [["input_3", 0, 0], ["input_2", 0, 0]], "name": "model_1"}, "backend": "tensorflow", "class_name": "Model"}