{"keras_version": "2.1.0", "config": [{"config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 256, 256, 1]}, "class_name": "InputLayer"}, {"config": {"dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_1", "bias_regularizer": null, "activation": "relu", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "strides": [2, 2], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 8}, "class_name": "Conv2D"}, {"config": {"dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_2", "bias_regularizer": null, "activation": "relu", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 8}, "class_name": "Conv2D"}, {"config": {"dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_3", "bias_regularizer": null, "activation": "relu", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 16}, "class_name": "Conv2D"}, {"config": {"dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_4", "bias_regularizer": null, "activation": "relu", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "strides": [2, 2], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 16}, "class_name": "Conv2D"}, {"config": {"dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_5", "bias_regularizer": null, "activation": "relu", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 32}, "class_name": "Conv2D"}, {"config": {"dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_6", "bias_regularizer": null, "activation": "relu", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "strides": [2, 2], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 32}, "class_name": "Conv2D"}, {"config": {"size": [2, 2], "trainable": true, "name": "up_sampling2d_1", "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"config": {"dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_7", "bias_regularizer": null, "activation": "relu", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 32}, "class_name": "Conv2D"}, {"config": {"size": [2, 2], "trainable": true, "name": "up_sampling2d_2", "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"config": {"dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_8", "bias_regularizer": null, "activation": "relu", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 16}, "class_name": "Conv2D"}, {"config": {"size": [2, 2], "trainable": true, "name": "up_sampling2d_3", "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"config": {"dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_9", "bias_regularizer": null, "activation": "tanh", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 2}, "class_name": "Conv2D"}], "backend": "tensorflow", "class_name": "Sequential"}